performance/jmeter/pdms-stepping-search-test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="PDMS - 复杂查询压测 (Resident Search)">
      <stringProp name="TestPlan.comments">
Target: localhost:8080
Core API: POST /api/resident/search (ES多条件 + PG回退)
Threads: 5 -&gt; 50 ramp-up 150s, duration 300s
      </stringProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments">
          <elementProp name="BASE_URL" elementType="Argument">
            <stringProp name="Argument.name">BASE_URL</stringProp>
            <stringProp name="Argument.value">172.22.217.154</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="PORT" elementType="Argument">
            <stringProp name="Argument.name">PORT</stringProp>
            <stringProp name="Argument.value">8080</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="PROTOCOL" elementType="Argument">
            <stringProp name="Argument.name">PROTOCOL</stringProp>
            <stringProp name="Argument.value">http</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="USERNAME" elementType="Argument">
            <stringProp name="Argument.name">USERNAME</stringProp>
            <stringProp name="Argument.value">admin</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="PASSWORD" elementType="Argument">
            <stringProp name="Argument.name">PASSWORD</stringProp>
            <stringProp name="Argument.value">Admin@123</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <kg.apc.jmeter.threads.SteppingThreadGroup guiclass="kg.apc.jmeter.threads.SteppingThreadGroupGui" testclass="kg.apc.jmeter.threads.SteppingThreadGroup" testname="Stepping (5→40, hold 300s)">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <stringProp name="ThreadGroup.num_threads">40</stringProp>
        <stringProp name="Threads initial delay">0</stringProp>
        <stringProp name="Start users count">5</stringProp>
        <stringProp name="Start users count burst">0</stringProp>
        <stringProp name="Start users period">60</stringProp>
        <stringProp name="Stop users count">5</stringProp>
        <stringProp name="Stop users period">1</stringProp>
        <stringProp name="flighttime">300</stringProp>
        <stringProp name="rampUp">30</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </kg.apc.jmeter.threads.SteppingThreadGroup>
      <hashTree>
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Defaults" enabled="true">
          <intProp name="HTTPSampler.connect_timeout">10000</intProp>
          <intProp name="HTTPSampler.response_timeout">30000</intProp>
          <stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
          <stringProp name="HTTPSampler.port">${PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">${PROTOCOL}</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="用户定义的变量">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </ConfigTestElement>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Common Headers" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json;charset=UTF-8</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Accept</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <OnceOnlyController guiclass="OnceOnlyControllerGui" testclass="OnceOnlyController" testname="Once Only - Login" enabled="true"/>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Login" enabled="true">
            <stringProp name="HTTPSampler.path">/api/auth/login</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&quot;username&quot;:&quot;${USERNAME}&quot;,&quot;password&quot;:&quot;${PASSWORD}&quot;}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree>
            <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract Token" enabled="true">
              <stringProp name="JSONPostProcessor.referenceNames">token</stringProp>
              <stringProp name="JSONPostProcessor.jsonPathExprs">$.data.accessToken</stringProp>
              <stringProp name="JSONPostProcessor.defaultValues">NO_TOKEN</stringProp>
            </JSONPostProcessor>
            <hashTree/>
          </hashTree>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Search" enabled="true">
          <stringProp name="HTTPSampler.path">/api/resident/search</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&quot;page&quot;:1,&quot;size&quot;:50,&quot;name&quot;:&quot;张&quot;,&quot;gender&quot;:&quot;男&quot;,&quot;nation&quot;:&quot;汉族&quot;,&quot;maritalStatus&quot;:&quot;已婚&quot;,&quot;householdStatus&quot;:&quot;正常&quot;,&quot;minAge&quot;:20,&quot;maxAge&quot;:60}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Auth Header" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer ${token}</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Randomize Body" enabled="true">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">
String[] bodies = [
  &apos;{&quot;page&quot;:1,&quot;size&quot;:50}&apos;,
  &apos;{&quot;page&quot;:1,&quot;size&quot;:50,&quot;name&quot;:&quot;张&quot;}&apos;,
  &apos;{&quot;page&quot;:1,&quot;size&quot;:50,&quot;gender&quot;:&quot;男&quot;}&apos;,
  &apos;{&quot;page&quot;:1,&quot;size&quot;:50,&quot;nation&quot;:&quot;汉族&quot;}&apos;,
  &apos;{&quot;page&quot;:1,&quot;size&quot;:50,&quot;maritalStatus&quot;:&quot;已婚&quot;}&apos;,
  &apos;{&quot;page&quot;:1,&quot;size&quot;:50,&quot;name&quot;:&quot;张&quot;,&quot;gender&quot;:&quot;男&quot;,&quot;nation&quot;:&quot;汉族&quot;}&apos;,
  &apos;{&quot;page&quot;:1,&quot;size&quot;:20,&quot;name&quot;:&quot;王&quot;,&quot;gender&quot;:&quot;女&quot;,&quot;maritalStatus&quot;:&quot;未婚&quot;,&quot;householdStatus&quot;:&quot;正常&quot;}&apos;,
  &apos;{&quot;page&quot;:2,&quot;size&quot;:30,&quot;name&quot;:&quot;李&quot;,&quot;nation&quot;:&quot;汉族&quot;,&quot;educationLevel&quot;:&quot;大学本科&quot;}&apos;,
  &apos;{&quot;page&quot;:1,&quot;size&quot;:50,&quot;name&quot;:&quot;张&quot;,&quot;gender&quot;:&quot;男&quot;,&quot;nation&quot;:&quot;汉族&quot;,&quot;maritalStatus&quot;:&quot;已婚&quot;,&quot;householdStatus&quot;:&quot;正常&quot;,&quot;minAge&quot;:20,&quot;maxAge&quot;:60}&apos;,
  &apos;{&quot;page&quot;:1,&quot;size&quot;:50,&quot;name&quot;:&quot;刘&quot;,&quot;gender&quot;:&quot;女&quot;,&quot;nation&quot;:&quot;回族&quot;,&quot;nationCode&quot;:&quot;03&quot;,&quot;educationLevel&quot;:&quot;研究生&quot;,&quot;educationCode&quot;:&quot;22&quot;,&quot;maritalStatus&quot;:&quot;已婚&quot;,&quot;householdStatus&quot;:&quot;正常&quot;,&quot;minAge&quot;:25,&quot;maxAge&quot;:55}&apos;,
  &apos;{&quot;page&quot;:1,&quot;size&quot;:50,&quot;gender&quot;:&quot;男&quot;,&quot;educationLevel&quot;:&quot;大学本科&quot;,&quot;maritalStatus&quot;:&quot;未婚&quot;,&quot;householdStatus&quot;:&quot;正常&quot;,&quot;minAge&quot;:18,&quot;maxAge&quot;:35}&apos;,
  &apos;{&quot;page&quot;:3,&quot;size&quot;:20,&quot;name&quot;:&quot;陈&quot;,&quot;nation&quot;:&quot;汉族&quot;,&quot;maritalStatus&quot;:&quot;已婚&quot;}&apos;,
  &apos;{&quot;page&quot;:1,&quot;size&quot;:10,&quot;name&quot;:&quot;赵&quot;,&quot;nation&quot;:&quot;满族&quot;,&quot;nationCode&quot;:&quot;11&quot;,&quot;educationLevel&quot;:&quot;高中&quot;,&quot;educationCode&quot;:&quot;30&quot;,&quot;maritalStatus&quot;:&quot;已婚&quot;,&quot;householdStatus&quot;:&quot;正常&quot;}&apos;,
  &apos;{&quot;page&quot;:1,&quot;size&quot;:50,&quot;minAge&quot;:60,&quot;maxAge&quot;:90}&apos;,
  &apos;{&quot;page&quot;:1,&quot;size&quot;:50,&quot;name&quot;:&quot;孙&quot;,&quot;gender&quot;:&quot;男&quot;,&quot;nation&quot;:&quot;汉族&quot;,&quot;educationLevel&quot;:&quot;大学本科&quot;,&quot;educationCode&quot;:&quot;21&quot;,&quot;maritalStatus&quot;:&quot;已婚&quot;,&quot;householdStatus&quot;:&quot;正常&quot;,&quot;minAge&quot;:30,&quot;maxAge&quot;:50}&apos;
];
int idx = new Random().nextInt(bodies.length);
sampler.getArguments().removeAllArguments();
sampler.addNonEncodedArgument(&quot;&quot;, bodies[idx], &quot;&quot;);
sampler.setPostBodyRaw(true);
            </stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
          </JSR223PreProcessor>
          <hashTree/>
        </hashTree>
        <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Think Time (100-500ms)" enabled="true">
          <stringProp name="ConstantTimer.delay">100</stringProp>
          <stringProp name="RandomTimer.range">500</stringProp>
        </UniformRandomTimer>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>